УТ_для_edt/src/AccumulationRegisters/смартГрафикОтгрузкиТоваровОрганизаций/смартГрафикОтгрузкиТоваровОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартГрафикОтгрузкиТоваровОрганизаций</name>
  <comment>//++ #Б1154 смарт: Шляпников 17.10.2024 / Контроль оперативных остатков в разрезе организаций</comment>
  <resources>
    <name>КоличествоИзЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНеобеспечено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоИзЗаказовГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоНеобеспеченоГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/смартДоступныеОстаткиПланируемыхПоступленийОрганизаций/смартДоступныеОстаткиПланируемыхПоступленийОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДоступныеОстаткиПланируемыхПоступленийОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДоступности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/НастройкаКонтроляОбеспечения/НастройкаКонтроляОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаКонтроляОбеспечения</name>
  <resources>
    <name>Контролировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/смартСвободныеОстаткиОрганизаций/смартСвободныеОстаткиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартСвободныеОстаткиОрганизаций</name>
  <comment>//++ #Б1154 смарт: Шляпников 17.10.2024 / Контроль оперативных остатков в разрезе организаций</comment>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеСоСклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВНаличииГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеСоСкладаГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/смартГрафикОтгрузкиТоваровОрганизаций/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства)
		И ПроведениеСерверУТ.КонтролироватьОбеспечение(ДополнительныеСвойства) Тогда

		ДанныеБлокировки = ДанныеБлокировки();

		Если ДанныеБлокировки.ТаблицаБлокируемыхИзмерений.Количество() = 0 Тогда
			ДополнительныеСвойства.РассчитыватьИзменения = Ложь;
		КонецЕсли;

	КонецЕсли;

	Если ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства)
		И ПроведениеСерверУТ.КонтролироватьОбеспечение(ДополнительныеСвойства) Тогда

		ЗаблокироватьРегистрыДляКонтроляОстатков(ДанныеБлокировки);
		СформироватьТаблицуИсходныхДвижений();

	КонецЕсли;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПоместитьВременнуюТаблицуИсходныхДвижений(Отбор.Регистратор.Значение, МенеджерВременныхТаблиц);
	ДополнительныеСвойства.Вставить("ГрафикОтгрузкиТоваровМенеджерВременныхТаблиц", МенеджерВременныхТаблиц);

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства)
		И ПроведениеСерверУТ.КонтролироватьОбеспечение(ДополнительныеСвойства) Тогда
		СформироватьТаблицуИзмененийДвижений();
	КонецЕсли;

	МенеджерВременныхТаблиц = ДополнительныеСвойства.ГрафикОтгрузкиТоваровМенеджерВременныхТаблиц;
	ЕстьИзменения = ПоместитьВременнуюТаблицуИзмененийДвижений(Отбор.Регистратор.Значение, МенеджерВременныхТаблиц);

	Если ЕстьИзменения Тогда

		РегистрыСведений.смартДоступныеОстаткиПланируемыхПоступленийОрганизаций.РассчитатьОстаткиГрафикаДвиженияТоваров(МенеджерВременныхТаблиц);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеБлокировки()

	ЕстьСтрокиБезКонтроля = Ложь;

	Набор = Новый ТаблицаЗначений();
	Набор.Колонки.Добавить("Организация",    Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Набор.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Набор.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Набор.Колонки.Добавить("Склад",          Новый ОписаниеТипов("СправочникСсылка.Склады"));
	НоваяСтрока = Неопределено;

	Для Каждого Запись Из ЭтотОбъект Цикл

		Если Запись.КоличествоИзЗаказов <> 0 Тогда

			Если НоваяСтрока = Неопределено Или
					НоваяСтрока.Организация <> Запись.Организация Или
					НоваяСтрока.Номенклатура <> Запись.Номенклатура Или
					НоваяСтрока.Характеристика <> Запись.Характеристика Или
					НоваяСтрока.Склад <> Запись.Склад Тогда

				НоваяСтрока = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);

			КонецЕсли;

		Иначе
			ЕстьСтрокиБезКонтроля = Истина;
		КонецЕсли;

	КонецЦикла;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.Организация         КАК Организация,
	|	Т.Номенклатура        КАК Номенклатура,
	|	Т.Характеристика      КАК Характеристика,
	|	Т.Склад               КАК Склад
	|ПОМЕСТИТЬ ВтНаборЗаписей
	|
	|ИЗ
	|	&НаборЗаписей КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация, Номенклатура, Характеристика, Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборЗаписей.Организация    КАК Организация,
	|	НаборЗаписей.Номенклатура   КАК Номенклатура,
	|	НаборЗаписей.Характеристика КАК Характеристика,
	|	НаборЗаписей.Склад          КАК Склад
	|
	|ИЗ
	|	ВтНаборЗаписей КАК НаборЗаписей
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|		ПО НаборЗаписей.Склад = НастройкаХарактеристика.Склад
	|		 И НаборЗаписей.Номенклатура = НастройкаХарактеристика.Номенклатура
	|		 И НаборЗаписей.Характеристика = НастройкаХарактеристика.Характеристика
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|		ПО НаборЗаписей.Склад = НастройкаНоменклатура.Склад
	|		 И НаборЗаписей.Номенклатура = НастройкаНоменклатура.Номенклатура
	|		 И НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|		ПО НаборЗаписей.Склад = НастройкаСклад.Склад
	|		 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|		 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|
	|ГДЕ
	|	ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|		ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|		НастройкаСклад.Контролировать))";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НаборЗаписей", Набор);
	ТаблицаБлокируемыхИзмерений = Запрос.Выполнить().Выгрузить();
	
	ТребуетсяУправляемаяБлокировка = ЕстьСтрокиБезКонтроля Или ТаблицаБлокируемыхИзмерений.Количество() < Набор.Количество();

	Возврат Новый Структура("ТребуетсяУправляемаяБлокировка, ТаблицаБлокируемыхИзмерений",
		ТребуетсяУправляемаяБлокировка, ТаблицаБлокируемыхИзмерений);

КонецФункции

Процедура ЗаблокироватьРегистрыДляКонтроляОстатков(ДанныеБлокировки)

	Блокировка = Новый БлокировкаДанных();

	// Устанавливаем блокировку только по тем измерениям, по которым необходим контроль остатков.
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.смартДоступныеОстаткиПланируемыхПоступленийОрганизаций");
	ЭлементБлокировки.Режим          = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ДанныеБлокировки.ТаблицаБлокируемыхИзмерений;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация",    "Организация");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",   "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад",          "Склад");

	// Устанавливаем блокировку второго регистра, данные которого понадобятся для контроля по измерениям, присутствующим в
	// наборе записей регистра "Движение товаров".
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.смартСвободныеОстаткиОрганизаций");
	ЭлементБлокировки.Режим          = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ДанныеБлокировки.ТаблицаБлокируемыхИзмерений;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация",    "Организация");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",   "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад",          "Склад");

	Блокировка.Заблокировать();

КонецПроцедуры

Процедура СформироватьТаблицуИсходныхДвижений()

	// Формирование таблиц.
	// Текущее состояние набора помещается во временную таблицу "ДвиженияПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Период                           КАК Период,
	|	Таблица.Организация                      КАК Организация,
	|	Таблица.Номенклатура                     КАК Номенклатура,
	|	Таблица.Характеристика                   КАК Характеристика,
	|	Таблица.Склад                            КАК Склад,
	|	-Таблица.КоличествоИзЗаказов             КАК КоличествоИзЗаказовПередЗаписью,
	|	-Таблица.смартКоличествоИзЗаказовГарантийные             КАК смартКоличествоИзЗаказовГарантийныеПередЗаписью
	|
	|ПОМЕСТИТЬ ГрафикОтгрузкиТоваровПередЗаписью
	|
	|ИЗ
	|	РегистрНакопления.смартГрафикОтгрузкиТоваровОрганизаций КАК Таблица
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|		ПО Таблица.Склад = НастройкаХарактеристика.Склад
	|		 И Таблица.Номенклатура = НастройкаХарактеристика.Номенклатура
	|		 И Таблица.Характеристика = НастройкаХарактеристика.Характеристика
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|		ПО Таблица.Склад = НастройкаНоменклатура.Склад
	|		 И Таблица.Номенклатура = НастройкаНоменклатура.Номенклатура
	|		 И НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|		ПО Таблица.Склад = НастройкаСклад.Склад
	|		 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|		 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|
	|	И ( Таблица.КоличествоИзЗаказов > 0
	|	ИЛИ Таблица.смартКоличествоИзЗаказовГарантийные > 0 )
	|	И (НЕ &ЭтоНовый)
	|
	|	И ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|		ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|		НастройкаСклад.Контролировать))";
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура СформироватьТаблицуИзмененийДвижений()

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Организация                                  КАК Организация,
	|	ТаблицаИзменений.Номенклатура                                 КАК Номенклатура,
	|	ТаблицаИзменений.Характеристика                               КАК Характеристика,
	|	ТаблицаИзменений.Склад                                        КАК Склад,
	|	ТаблицаИзменений.Период                                       КАК Период,
	|	СУММА(ТаблицаИзменений.КоличествоИзЗаказовИзменение)          КАК КоличествоИзЗаказовИзменение,
	|	СУММА(ТаблицаИзменений.смартКоличествоИзЗаказовГарантийныеИзменение)          КАК смартКоличествоИзЗаказовГарантийныеИзменение
	|
	|ПОМЕСТИТЬ ДвиженияГрафикОтгрузкиТоваровИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период                          КАК Период,
	|		Таблица.Организация                     КАК Организация,
	|		Таблица.Номенклатура                    КАК Номенклатура,
	|		Таблица.Характеристика                  КАК Характеристика,
	|		Таблица.Склад                           КАК Склад,
	|		Таблица.КоличествоИзЗаказовПередЗаписью КАК КоличествоИзЗаказовИзменение,
	|		Таблица.смартКоличествоИзЗаказовГарантийныеПередЗаписью КАК смартКоличествоИзЗаказовГарантийныеИзменение
	|	ИЗ
	|		ГрафикОтгрузкиТоваровПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период                          КАК Период,
	|		Таблица.Организация                     КАК Организация,
	|		Таблица.Номенклатура                    КАК Номенклатура,
	|		Таблица.Характеристика                  КАК Характеристика,
	|		Таблица.Склад                           КАК Склад,
	|		Таблица.КоличествоИзЗаказов             КАК КоличествоИзЗаказовИзменение,
	|		Таблица.смартКоличествоИзЗаказовГарантийные             КАК смартКоличествоИзЗаказовГарантийныеИзменение
	|	ИЗ
	|		РегистрНакопления.смартГрафикОтгрузкиТоваровОрганизаций КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|		ПО Таблица.Склад = НастройкаХарактеристика.Склад
	|		 И Таблица.Номенклатура = НастройкаХарактеристика.Номенклатура
	|		 И Таблица.Характеристика = НастройкаХарактеристика.Характеристика
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|		ПО Таблица.Склад = НастройкаНоменклатура.Склад
	|		 И Таблица.Номенклатура = НастройкаНоменклатура.Номенклатура
	|		 И Таблица.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И Таблица.Склад   ЕСТЬ NULL
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|		ПО Таблица.Склад = НастройкаСклад.Склад
	|		 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|		 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор
	|
	|		И ( Таблица.КоличествоИзЗаказов > 0
	|		ИЛИ  Таблица.смартКоличествоИзЗаказовГарантийные > 0 )
	|
	|		И ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|			ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|			НастройкаСклад.Контролировать))
	|
	|	) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Период,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.Характеристика,
	|	ТаблицаИзменений.Склад
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.КоличествоИзЗаказовИзменение) > 0
	|	ИЛИ СУММА(ТаблицаИзменений.смартКоличествоИзЗаказовГарантийныеИзменение) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГрафикОтгрузкиТоваровПередЗаписью";

	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	Выборка.Следующий();

	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияГрафикОтгрузкиТоваровИзменение", Выборка.Количество > 0);

КонецПроцедуры

Процедура ПоместитьВременнуюТаблицуИсходныхДвижений(Ссылка, МенеджерВременныхТаблиц)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Организация    КАК Организация,
		|	Т.Номенклатура   КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	Т.Склад          КАК Склад,
		|
		|	Т.ДатаОтгрузки        КАК ДатаОтгрузки,
		|	Т.КоличествоИзЗаказов КАК КоличествоПередЗаписью,
		|	Т.смартКоличествоИзЗаказовГарантийные КАК смартКоличествоИзЗаказовГарантийныеПередЗаписью
		|
		|ПОМЕСТИТЬ ВТГрафикОтгрузкиТоваровПередЗаписью
		|ИЗ
		|	РегистрНакопления.смартГрафикОтгрузкиТоваровОрганизаций КАК Т
		|ГДЕ
		|	Т.Регистратор = &Регистратор
		|	И ( Т.КоличествоИзЗаказов <> 0
		|	ИЛИ  Т.смартКоличествоИзЗаказовГарантийные <> 0 )");

	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();

КонецПроцедуры

Функция ПоместитьВременнуюТаблицуИзмененийДвижений(Ссылка, МенеджерВременныхТаблиц)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Набор.Организация    КАК Организация,
		|	Набор.Номенклатура   КАК Номенклатура,
		|	Набор.Характеристика КАК Характеристика,
		|	Набор.Склад          КАК Склад
		|
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ(
		|	ВЫБРАТЬ
		|		ПередЗаписью.Организация            КАК Организация,
		|		ПередЗаписью.Номенклатура           КАК Номенклатура,
		|		ПередЗаписью.Характеристика         КАК Характеристика,
		|		ПередЗаписью.Склад                  КАК Склад,
		|
		|		ПередЗаписью.ДатаОтгрузки            КАК ДатаОтгрузки,
		|		-ПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение,
		|		-ПередЗаписью.смартКоличествоИзЗаказовГарантийныеПередЗаписью КАК смартКоличествоИзЗаказовГарантийныеИзменение
		|	ИЗ
		|		ВТГрафикОтгрузкиТоваровПередЗаписью КАК ПередЗаписью
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПриЗаписи.Организация            КАК Организация,
		|		ПриЗаписи.Номенклатура           КАК Номенклатура,
		|		ПриЗаписи.Характеристика         КАК Характеристика,
		|		ПриЗаписи.Склад                  КАК Склад,
		|
		|		ПриЗаписи.ДатаОтгрузки           КАК ДатаОтгрузки,
		|		ПриЗаписи.КоличествоИзЗаказов    КАК КоличествоИзменение,
		|		ПриЗаписи.смартКоличествоИзЗаказовГарантийные    КАК смартКоличествоИзЗаказовГарантийныеИзменение
		|	ИЗ
		|		РегистрНакопления.смартГрафикОтгрузкиТоваровОрганизаций КАК ПриЗаписи
		|	ГДЕ
		|		ПриЗаписи.Регистратор = &Регистратор
		|		И ( ПриЗаписи.КоличествоИзЗаказов <> 0
		|		ИЛИ ПриЗаписи.смартКоличествоИзЗаказовГарантийные <> 0 )) КАК Набор
		|
		|СГРУППИРОВАТЬ ПО
		|	Набор.Организация, Набор.Номенклатура, Набор.Характеристика, Набор.Склад,
		|	Набор.ДатаОтгрузки
		|
		|ИМЕЮЩИЕ
		|	СУММА(Набор.КоличествоИзменение) <> 0
		|	ИЛИ СУММА(Набор.смартКоличествоИзЗаказовГарантийныеИзменение) <> 0");

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

#КонецОбласти

#КонецЕсли
